# NoAutoRouteSolutionFoundError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AutoRouteFailures..::..NoAutoRouteSolutionFoundError Property
BuiltInFailures..::..AutoRouteFailures Class See Also
---
No auto-route solution was found.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoAutoRouteSolutionFoundError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoAutoRouteSolutionFoundError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoAutoRouteSolutionFoundError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AutoRouteFailures Class
Autodesk.Revit.DB Namespace